validation/denseAGFoam/verticalChannel-a01-p4/0.org/Sigma.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      Sigma.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 0 2 -2 0 0 0 0 ];

internalField       uniform (0 0 0 0 0 0);

boundaryField
{
    right
    {
        type            zeroGradient;
    }
    left
    {
        type            zeroGradient;
    }
    top
    {
		type            	cyclic;
    }
    bottom
    {
		type            	cyclic;
    }
    front
    {
		type            	cyclic;
    }
    back
    {
		type            	cyclic;
    }
}

// ************************************************************************* //
