validation/denseAGFoam/verticalChannel-a01-p4/0.org/U.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0.5 0);

boundaryField
{
    right
    {
// 	    type               fixedValue;
        type               JohnsonJacksonParticleSlip;
        specularityCoefficient  0.1;
        restitutionCoefficient  0.9;
        internalFrictionAngle   0.25;
	    value              uniform (0 0 0);
    }
    left
    {
// 	    type               fixedValue;
        type               JohnsonJacksonParticleSlip;
        specularityCoefficient  0.1;
        restitutionCoefficient  0.9;
        internalFrictionAngle   0.25;
	    value              uniform (0 0 0);
    }
    top
    {
		type            	cyclic;
    }
    bottom
    {
		type            	cyclic;
    }
    front
    {
		type            	cyclic;
    }
    back
    {
		type            	cyclic;
    }
}

// ************************************************************************* //
